MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX250F128B.PIC
      <edc:AdjustPoint edc:_addr="0x1F80FB5C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FB60" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="19" edc:access="----------------------------nnnn" edc:cname="RPB13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB13R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB13R" edc:desc="" edc:mask="0xf" edc:name="RPB13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB64" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="20" edc:access="----------------------------nnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:desc="" edc:mask="0xf" edc:name="RPB14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB68" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0xf" edc:name="RPB15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB6C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:desc="" edc:mask="0xf" edc:name="RPC0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB70" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="23" edc:access="----------------------------nnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0xf" edc:name="RPC1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB74" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="24" edc:access="----------------------------nnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0xf" edc:name="RPC2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB78" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="25" edc:access="----------------------------nnnn" edc:cname="RPC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC3R" edc:desc="" edc:mask="0xf" edc:name="RPC3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB7C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="26" edc:access="----------------------------nnnn" edc:cname="RPC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC4R" edc:desc="" edc:mask="0xf" edc:name="RPC4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB80" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="27" edc:access="----------------------------nnnn" edc:cname="RPC5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC5R" edc:desc="" edc:mask="0xf" edc:name="RPC5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB84" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="28" edc:access="----------------------------nnnn" edc:cname="RPC6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC6R" edc:desc="" edc:mask="0xf" edc:name="RPC6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB88" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="29" edc:access="----------------------------nnnn" edc:cname="RPC7R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC7R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC7R" edc:desc="" edc:mask="0xf" edc:name="RPC7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB8C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="30" edc:access="----------------------------nnnn" edc:cname="RPC8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC8R" edc:desc="" edc:mask="0xf" edc:name="RPC8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB90" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="31" edc:access="----------------------------nnnn" edc:cname="RPC9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC9R" edc:desc="" edc:mask="0xf" edc:name="RPC9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f887000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph2">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="4096"/>
      <edc:SFRDef edc:_addr="0x1F881000" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01423_TRAA_int_evic.Module" edc:_refcount="1" edc:access="---------------n---n-nnn---nnnnn" edc:cname="INTCON" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0-0-0-000---00000" edc:name="INTCON" edc:nzwidth="0x20" edc:por="---------------0-0-0-000---00000" edc:portals="CLR SET INV" ltx:baseofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TPC" edc:desc="" edc:mask="0x7" edc:name="TPC" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MVEC" edc:desc="" edc:mask="0x1" edc:name="MVEC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SS0" edc:desc="" edc:mask="0x1" edc:name="SS0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INTERRUPT CONTROL" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881010" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01423_TRAA_int_evic.Module" edc:_refcount="1" edc:access="---------------------nnn--nnnnnn" edc:cname="INTSTAT" edc:desc="" edc:grp="EVIC" edc:impl="0xffffff3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------000--000000" edc:name="INTSTAT" edc:nzwidth="0x20" edc:por="---------------------000--000000" edc:portals="- - -" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VEC" edc:desc="" edc:mask="0x3f" edc:name="VEC" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SRIPL" edc:desc="" edc:mask="0x7" edc:name="SRIPL" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881020" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01423_TRAA_int_evic.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881030" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01423_TRAA_int_evic.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000x0000x0000x0000000000000000" edc:name="IFS0" edc:nzwidth="0x20" edc:por="00000x0000x0000x0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC5IF" edc:desc="" edc:mask="0x1" edc:name="IC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IF" edc:desc="" edc:mask="0x1" edc:name="OC5IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSCMIF" edc:desc="" edc:mask="0x1" edc:name="FSCMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881040" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01423_TRAA_int_evic.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxx00xxxx00000000000000000000" edc:name="IFS1" edc:nzwidth="0x20" edc:por="xxxxxx00xxxx00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:desc="" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
